InformationRegisters/ВыплатыПоПремиям1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ВыплатыПоПремиям1</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаВыплаты</Name>
					<Comment>Дата последней выплаты</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разослано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассылкаУтверждающим</Name>
					<Comment>0 - не рассылать, 1- к рассылке, 2- разослано</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРассылкиФЛ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Премии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>Премии</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСНДФЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ВыплатыПоПремиям1/Ext/ManagerModule.bsl
//+++ АК Pans 20160426 ИП-00014932
Процедура ЗаполнитьИнформациюОВыплатеПремииПоДокументу(ДокументОбъект) Экспорт
	
	Если ДокументОбъект.Проведен Тогда
		
		ОТЧисло = Новый ОписаниеТипов("Число");
		ОТДата = Новый ОписаниеТипов("Дата");
		ТЗФЛ = Новый ТаблицаЗначений;
		ТЗФЛ.Колонки.Добавить("ФизЛицо");
		ТЗФЛ.Колонки.Добавить("МесяцНачисления", ОТДата);
		ТЗФЛ.Колонки.Добавить("СуммаНачисленияВсего", ОТЧисло);
		ТЗФЛ.Колонки.Добавить("СуммаВыплатыВсего", ОТЧисло);
		//ТЗФЛ.Колонки.Добавить("НомераСтрок");
		ТЗФЛ.Колонки.Добавить("ВсеНачисленияИВыплаты");
		ТЗФЛ.Колонки.Добавить("СуммаВыплатыПоДокументу", ОТЧисло);
		ТЗФЛ.Колонки.Добавить("ДатаВыплатыПоДокументу", ОТДата);
		ТЗФЛ.Колонки.Добавить("ОстатокКРаспределениюПоФЛ", ОТЧисло); // служебное поле
		
		
		Запрос1 = Новый Запрос;
		Запрос1.Текст = 
		"ВЫБРАТЬ
		|	Премии.ФизЛицо,
		|	СУММА(Премии.Сумма) КАК Сумма,
		|	СУММА(Премии.СуммаСНДФЛ) КАК СуммаСНДФЛ
		|ИЗ
		|	РегистрНакопления.Премии КАК Премии
		|ГДЕ
		|	Премии.Регистратор = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	Премии.ФизЛицо";
		
		Запрос1.УстановитьПараметр("Регистратор", ДокументОбъект.Ссылка);
		
		Рез1 = Запрос1.Выполнить();
		Выб1 = Рез1.Выбрать();
		//Для каждого СтрокаТЧС Из ДокументОбъект.Состав Цикл
		Пока Выб1.Следующий() Цикл
			СтрокаТЗФЛ = ТЗФЛ.Найти(Выб1.ФизЛицо, "ФизЛицо");
			Если СтрокаТЗФЛ = Неопределено Тогда
				СтрокаТЗФЛ = ТЗФЛ.Добавить();
				СтрокаТЗФЛ.МесяцНачисления = НачалоМесяца(ДокументОбъект.Дата);
				СтрокаТЗФЛ.ФизЛицо = Выб1.ФизЛицо;
				//СтрокаТЗФЛ.НомераСтрок = Новый Массив;
				СтрокаТЗФЛ.ВсеНачисленияИВыплаты = ПолучитьТЗВсехНачисленийИВыплат(СтрокаТЗФЛ);
				Для каждого СтрокаНиВ Из СтрокаТЗФЛ.ВсеНачисленияИВыплаты Цикл
					Если СтрокаНиВ.Документ = ДокументОбъект.Ссылка Тогда
						СтрокаТЗФЛ.СуммаВыплатыПоДокументу = СтрокаТЗФЛ.СуммаВыплатыПоДокументу + СтрокаНиВ.СуммаВыплаты;
						Если СтрокаТЗФЛ.ДатаВыплатыПоДокументу < СтрокаНиВ.ДатаВыплаты Тогда
							СтрокаТЗФЛ.ДатаВыплатыПоДокументу = СтрокаНиВ.ДатаВыплаты;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				СтрокаТЗФЛ.ОстатокКРаспределениюПоФЛ = СтрокаТЗФЛ.СуммаВыплатыПоДокументу;
				
			КонецЕсли;
			СтрокаТЗФЛ.СуммаНачисленияВсего = СтрокаТЗФЛ.СуммаНачисленияВсего + Выб1.СуммаСНДФЛ;
			//СтрокаТЗФЛ.НомераСтрок.Добавить(СтрокаТЧС.НомерСтроки);
		КонецЦикла;
		
		
		// теперь перебираем строки ТЧ и для каждой фамилии и документа ищем запись в ТЗ СтрокаТЗФЛ.ВсеНачисленияИВыплаты
		// берём оттуда оставшуюся сумму
			
		Для каждого СтрокаТЧС Из ДокументОбъект.Состав Цикл
			СтрокаТЗФЛ = ТЗФЛ.Найти(СтрокаТЧС.ФизЛицо, "ФизЛицо");
			Если СтрокаТЗФЛ <> Неопределено Тогда
				Если СтрокаТЗФЛ.ОстатокКРаспределениюПоФЛ <=0 Тогда
					Продолжить;
				КонецЕсли;
				Если СтрокаТЧС.Сумма <= СтрокаТЗФЛ.ОстатокКРаспределениюПоФЛ Тогда
					СуммаВыплатыПоСтроке = СтрокаТЧС.Сумма;
				Иначе
					СуммаВыплатыПоСтроке = СтрокаТЗФЛ.ОстатокКРаспределениюПоФЛ;
				КонецЕсли;
				СтрокаТЗФЛ.ОстатокКРаспределениюПоФЛ = СтрокаТЗФЛ.ОстатокКРаспределениюПоФЛ - СуммаВыплатыПоСтроке;
				СтрокаТЧС.ИнформацияОВыплатах = Строка(СуммаВыплатыПоСтроке) + " от " + Формат(СтрокаТЗФЛ.ДатаВыплатыПоДокументу, "ДЛФ=Д");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для каждого СтрокакТЧ1 Из ДокументОбъект.Состав Цикл
		Если НЕ ДокументОбъект.Проведен Тогда
			СтрокакТЧ1.ИнформацияОВыплатах = "-";
		Иначе
			//-----------
		
		КонецЕсли;
		
		
		
	
	КонецЦикла;
	
КонецПроцедуры // ()

Функция ПолучитьТЗВсехНачисленийИВыплат(КоллЗнач)
	
	ОТЧисло = Новый ОписаниеТипов("Число");
	ОТДата = Новый ОписаниеТипов("Дата");
	ТЗРез = Новый ТаблицаЗначений;
	ТЗРез.Колонки.Добавить("Дата", ОТДата);
	ТЗРез.Колонки.Добавить("Приоритет");
	ТЗРез.Колонки.Добавить("Документ");
	ТЗРез.Колонки.Добавить("Начислено", ОТЧисло);
	ТЗРез.Колонки.Добавить("СуммаВыплаты", ОТЧисло);
	ТЗРез.Колонки.Добавить("ДатаВыплаты", ОТДата);
	
	Рез1 = ПолучитьДокументыПремий(КоллЗнач.ФизЛицо, КоллЗнач.МесяцНачисления);
	Выб1 = Рез1.Выбрать();
	
	Пока Выб1.Следующий() Цикл
		СтрокаТЗРез = ТЗРез.Добавить();
		СтрокаТЗРез.Дата = Выб1.Период;
		СтрокаТЗРез.Документ = Выб1.Регистратор;
		Если ТипЗнч(СтрокаТЗРез.Документ) = Тип("ДокументСсылка.НачислениеПремии") Тогда
			СтрокаТЗРез.Приоритет = 1;
		ИначеЕсли ТипЗнч(СтрокаТЗРез.Документ) = Тип("ДокументСсылка.НачислениеПремииОфиснымРаботникам") Тогда
			СтрокаТЗРез.Приоритет = 2;
		Иначе
			СтрокаТЗРез.Приоритет = 99;
		КонецЕсли;
		СтрокаТЗРез.Начислено = Выб1.Сумма;
	КонецЦикла;
	ТЗРез.Сортировать("Дата, Приоритет");
	
	
	// дозаплним колонки "СуммаВыплаты" и "ДатаВыплаты"
	// сначала найдём общую сумму выплат в РС "ВыплатыПоПремиям1"
		
	Запрос1 = Новый Запрос;
	Запрос1.Текст = 
	"ВЫБРАТЬ
	|	ВыплатыПоПремиям1.Сумма,
	|	ВыплатыПоПремиям1.Период КАК Дата,
	|	ВыплатыПоПремиям1.ФизЛицо,
	|	ВыплатыПоПремиям1.ДатаВыплаты КАК ДатаВыплаты
	|ИЗ
	|	РегистрСведений.ВыплатыПоПремиям1 КАК ВыплатыПоПремиям1
	|ГДЕ
	|	ВыплатыПоПремиям1.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И ВыплатыПоПремиям1.ФизЛицо = &ФизЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВыплаты УБЫВ";
	
	Запрос1.УстановитьПараметр("ДатаНач", НачалоМесяца(КоллЗнач.МесяцНачисления));
	Запрос1.УстановитьПараметр("ДатаКон", КонецМесяца(КоллЗнач.МесяцНачисления));
	Запрос1.УстановитьПараметр("ФизЛицо", КоллЗнач.ФизЛицо);
	Рез1 = Запрос1.Выполнить();
	Если Рез1.Пустой() Тогда
		Возврат ТЗРез;
	КонецЕсли;
	
	ТЗВыплат = Рез1.Выгрузить();
	ВсегоВыплачено = ТЗВыплат.Итог("Сумма");
	ДатаВыплаты = ТЗВыплат[0].ДатаВыплаты;
	ОстатокКРаспределению = ВсегоВыплачено;
	Для каждого СтрокаТЗРез Из ТЗРез Цикл
		Если ОстатокКРаспределению = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Если СтрокаТЗРез.Начислено <= ОстатокКРаспределению Тогда
			СтрокаТЗРез.СуммаВыплаты = СтрокаТЗРез.Начислено;
		Иначе
			СтрокаТЗРез.СуммаВыплаты = ОстатокКРаспределению;
		КонецЕсли;
		ОстатокКРаспределению = ОстатокКРаспределению - СтрокаТЗРез.СуммаВыплаты;
		СтрокаТЗРез.ДатаВыплаты = ДатаВыплаты;
		
		Если ТЗРез.Индекс(СтрокаТЗРез) = ТЗРез.Количество() - 1 Тогда // т.е. это последняя строка
			// если остался остаток к начислению, то прибавим его к последней записи
			Если ОстатокКРаспределению > 0 Тогда
				СтрокаТЗРез.СуммаВыплаты = СтрокаТЗРез.СуммаВыплаты + ОстатокКРаспределению;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТЗРез

КонецФункции // ()

Процедура УдалитьВсеВыплатыИзДокументов(ФизЛицо, Период) Экспорт

	Рез1 = ПолучитьДокументыПремий(ФизЛицо, Период);
	Выб1 = Рез1.Выбрать();
	Пока Выб1.Следующий() Цикл
		Если ТипЗнч(Выб1.Регистратор) <> Тип("ДокументСсылка.НачислениеПремии")
		И ТипЗнч(Выб1.Регистратор) <> Тип("ДокументСсылка.НачислениеПремииОфиснымРаботникам") Тогда
			Продолжить;
		КонецЕсли;
		ДокОбъект = Выб1.Регистратор.ПолучитьОбъект();
		Для каждого СтрокаТЧС Из ДокОбъект.Состав Цикл
			Если СтрокаТЧС.ФизЛицо = ФизЛицо Тогда
				СтрокаТЧС.ВыплаченнаяСумма = 0;
				СтрокаТЧС.ДатаВыплаты = Неопределено;
			КонецЕсли;
		КонецЦикла;
		ДокОбъект.Записать();
	КонецЦикла;
	

КонецПроцедуры

Процедура ОбновитьВсеВыплатыВДокументах(ФизЛицо, Период) Экспорт

	СП1 = Новый Структура;
	СП1.Вставить("ФизЛицо", ФизЛицо);
	СП1.Вставить("МесяцНачисления", НачалоМесяца(Период));
	ВсеНачисленияИВыплаты = ПолучитьТЗВсехНачисленийИВыплат(СП1);
	ОТЧисло = Новый ОписаниеТипов("Число");
	ВсеНачисленияИВыплаты.Колонки.Добавить("РаспределеннаяСумма", ОТЧисло);
	МассивДок = Новый Массив;
	Для каждого СтрокаТЗ1 Из ВсеНачисленияИВыплаты Цикл
		Эл1 = МассивДок.Найти(СтрокаТЗ1.Документ);
		Если Эл1 = Неопределено Тогда
			МассивДок.Добавить(СтрокаТЗ1.Документ);
		КонецЕсли;
	КонецЦикла;
	Для каждого ДокСсылка Из МассивДок Цикл
		Для каждого СтрокаТЗ1 Из ВсеНачисленияИВыплаты Цикл
			Если СтрокаТЗ1.Документ <> ДокСсылка Тогда
				Продолжить;
			КонецЕсли;
			ДокОбъект = ДокСсылка.ПолучитьОбъект();
			
			Для каждого СтрокаТЧ1 Из ДокОбъект.Состав Цикл
				Если СтрокаТЧ1.ФизЛицо = ФизЛицо Тогда
					Если СтрокаТЧ1.Сумма < СтрокаТЗ1.СуммаВыплаты - СтрокаТЗ1.РаспределеннаяСумма Тогда // то, вероятно, в документе несколько строк с одним ФЛ
						СтрокаТЧ1.ВыплаченнаяСумма = СтрокаТЧ1.Сумма;	
					Иначе
						СтрокаТЧ1.ВыплаченнаяСумма = СтрокаТЗ1.СуммаВыплаты - СтрокаТЗ1.РаспределеннаяСумма
					КонецЕсли; 
					СтрокаТЗ1.РаспределеннаяСумма = СтрокаТЗ1.РаспределеннаяСумма + СтрокаТЧ1.ВыплаченнаяСумма;
					СтрокаТЧ1.ДатаВыплаты = СтрокаТЗ1.ДатаВыплаты;
				КонецЕсли;
			КонецЦикла;
			
			Если СтрокаТЗ1.СуммаВыплаты - СтрокаТЗ1.РаспределеннаяСумма > 0 Тогда // добавим к самой последней записи с данным ФЛ
				ВсегоСтрокТЧ = ДокОбъект.Состав.Количество();
				Для Сч1 = 1 По ВсегоСтрокТЧ Цикл
					ТекСтрокаТЧ = ДокОбъект.Состав[ВсегоСтрокТЧ - Сч1];
					Если ТекСтрокаТЧ.ФизЛицо = ФизЛицо Тогда
						ТекСтрокаТЧ.ВыплаченнаяСумма = ТекСтрокаТЧ.ВыплаченнаяСумма + (СтрокаТЗ1.СуммаВыплаты - СтрокаТЗ1.РаспределеннаяСумма);
					КонецЕсли; 
				КонецЦикла;
			КонецЕсли; 
			ДокОбъект.Записать();
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьДокументыПремий(ФизЛицо, Период)

	Запрос1 = Новый Запрос;
	Запрос1.Текст = 
	"ВЫБРАТЬ
	|	Премии.Период,
	|	Премии.Регистратор,
	|	Премии.ФизЛицо,
	|	СУММА(Премии.СуммаСНДФЛ) КАК СуммаСНДФЛ,
	|	СУММА(Премии.Сумма) КАК Сумма
	|ИЗ
	|	РегистрНакопления.Премии КАК Премии
	|ГДЕ
	|	Премии.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И Премии.ФизЛицо = &ФизЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	Премии.Период,
	|	Премии.Регистратор,
	|	Премии.ФизЛицо";
	
	Запрос1.УстановитьПараметр("ДатаНач", НачалоМесяца(Период));
	Запрос1.УстановитьПараметр("ДатаКон", КонецМесяца(Период));
	Запрос1.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	Возврат Запрос1.Выполнить();

КонецФункции // ()


//Функция ПолучитьТЗВыплат()

//	ОТДата = Новый ОписаниеТипов("Дата");
//	ОТЧисло = Новый ОписаниеТипов("Число");
//	ТЗРез = Новый ТаблицаЗначений;
//	ТЗРез.Колонки.Добавить("Дата", ОТДата);
//	ТЗРез.Колонки.Добавить("Сумма", ОТЧисло);
//	
//	Возврат ТЗРез;

//КонецФункции // ()

//--- АК Pans 20160426 ИП-00014932
